Revit 2027 API
IFCExtrusionCalculatorOptions.ExtrusionAxes Property
 The extrusion axes to try when doing the calculation.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExtrusionAxes ExtrusionAxes { get; set; }
Public Property ExtrusionAxes As IFCExtrusionAxes
	Get
	Set
public:
property IFCExtrusionAxes ExtrusionAxes {
	IFCExtrusionAxes get ();
	void set (IFCExtrusionAxes value);
}
member ExtrusionAxes : IFCExtrusionAxes with get, set
Property Value
IFCExtrusionAxes
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace